<?php

namespace App\Exceptions\Management;

use App\Exceptions\BaseException;

/**
 * crm用户模块相关异常
 */
class CrmUserException extends BaseException
{
    /**
     * @var array
     */
    protected static array $codeMaps = [
        100001 => [
            'message' => '账号已失效，无法操作',
        ],
        100002 => [
            'message' => '员工身份只能新增，不能取消',
        ],
        100003 => [
            'message' => '合同已设置有效期',
        ],
        100004 => [
            'message' => '角色已关联职位，请前往职位管理修改名称',
        ],
        100005 => [
            'message' => '职位等级不能高于直属上级的职位等级',
        ],
        100006 => [
            'message' => '职位等级不能低于直接下属的等级，请先调整下属职位',
        ],
        100007 => [
            'message' => '手机号码存在分配关联的crm用户，不能被删除',
        ],
        100017 => [
            'message' => '该执业证已经被注销，无法关联',
        ],
        100018 => [
            'message' => '员工身份接客参数有误',
        ],
        100019 => [
            'message' => '请先将其移除团队再登记离职',
        ],
        100020 => [
            'message' => '该员工不是顾问身份',
        ],
        100021 => [
            'message' => ' 员工已登记执业登记，不可关联其他执业资格证',
        ],
        100022 => [
            'message' => '该平台的外部工号已存在，请勿重复创建',
        ],
        100023 => [
            'message' => '请先注销该员工的外部工号',
        ],
        100030 => [
            'message' => ' 员工已登记执业登记，不可取消关联执业证',
        ],
        100031 => [
            'message' => '请先转移内部员工的执业关联，再注销执业证',
        ],
        100040 => [
            'message' => '存在成员已经有关联的部门了',
        ],
        100041 => [
            'message' => '该手机号已经有成员使用',
        ],
        100042 => [
            'message' => '该账号已经有成员使用',
        ],
        100043 => [
            'message' => '该工号已经有成员使用',
        ],
        100050 => [
            'message' => '该人员已移除待创建列表',
        ],
    ];

}
